{
    "nav_about": "About",
    "nav_skills": "Skills",
    "nav_projects": "Projects",
    "nav_education": "Education",
    "nav_contact": "Contact",
    "hero_hi": "Hi, my name is",
    "hero_subtitle": "Systems Engineering Student & Software Developer",
    "hero_desc": "Specialized in working at the system level with C++ and Linux, and moving to the cloud with Automation and Web solutions. I build efficient software by understanding how the hardware works behind the scenes.",
    "hero_cta": "View Projects",
    "about_title": "About Me",
    "about_p1": "I am a Computer Systems Engineering student at UNITEC, having completed over 65% of my degree. My profile is hybrid: I possess a solid academic foundation in Digital Logic, Data Structures, and Networks, which I complement with an intense self-taught curiosity for Artificial Intelligence and Cybersecurity.",
    "about_p2": "Currently, I am delving into the development of AI models from scratch (without libraries) and advanced Linux system administration. I am motivated by solving complex problems where optimization and performance are key.",
    "skills_title": "Skills",
    "skill_cat_lang": "Programming Languages",
    "skill_cat_tech": "Technologies & Tools",
    "skill_db_mod": "Database & Table Modeling",
    "skill_cat_fund": "Engineering Fundamentals",
    "projects_title": "Featured Projects",
    "label_desc": "Description:",
    "label_achieve": "Achievement:",
    "proj1_title": "Neural Network Simulator in C++",
    "proj1_desc": "Development of a feed-forward neural network from scratch, without using external AI libraries. I manually implemented the backpropagation algorithm, activation functions, and binary file handling for training.",
    "proj1_achieve": "Demonstration of a deep understanding of the mathematical foundations of AI and memory optimization in C++.",
    "proj2_title": "Report Automation System",
    "proj2_desc": "Enterprise solution to automate the generation of service reports. The system connects Google Forms with Google Slides and Sheets, eliminating manual data entry.",
    "proj2_achieve": "Estimated 90% reduction in the time required to create repetitive documents and elimination of human error.",
    "proj3_title": "UniTask - Web Platform",
    "proj3_desc": "A marketplace-type web platform that connects students to delegate and complete academic tasks. It includes a user authentication system, database management, and an administration panel.",
    "proj3_achieve": "Complete full-stack development, from database design to user interface.",
    "proj4_title": "Linux Process Monitor",
    "proj4_desc": "An auditing tool for Linux servers. Custom scripts to monitor critical daemons (Systemd), count active processes, and verify environment integrity.",
    "edu_title": "Education",
    "edu_degree": "Computer Systems Engineering",
    "edu_status": "Currently enrolled (Overall GPA: 8.0)",
    "edu_courses_title": "Outstanding Courses (Achieved):",
    "course_1": "Kinematics and Dynamics (10)",
    "course_2": "Object-Oriented Programming (9)",
    "course_3": "Information Systems (9)",
    "course_4": "Memory and Peripherals (9)",
    "edu_next": "Next Steps:",
    "edu_next_desc": "Digital Image Processing and WAN Security (Semester 26-1).",
    "contact_next": "What's Next?",
    "contact_title": "Get In Touch",
    "contact_desc": "I'm currently looking for new opportunities to apply my skills in automation and data analysis. Whether you have a question or just want to say hi, shoot me an email at hectore.salazar83@gmail.com!",
    "contact_btn": "Say Hello",
    "footer_credit": "Designed & Built by Héctor Salazar"
}