{
    "nav_about": "Sobre mí",
    "nav_skills": "Habilidades",
    "nav_projects": "Proyectos",
    "nav_education": "Educación",
    "nav_contact": "Contacto",
    "hero_hi": "Hola, mi nombre es",
    "hero_subtitle": "Estudiante de Ingeniería en Sistemas y Desarrollador de Software",
    "hero_desc": "Especializado en trabajar a nivel de sistema con C++ y Linux, y migrando a la nube con soluciones de Automatización y Web. Construyo software eficiente entendiendo cómo funciona el hardware detrás de escena.",
    "hero_cta": "Ver Proyectos",
    "about_title": "Sobre Mí",
    "about_p1": "Soy estudiante de Ingeniería en Sistemas Computacionales en UNITEC, con más del 65% de la carrera completada. Mi perfil es híbrido: poseo una sólida base académica en Lógica Digital, Estructuras de Datos y Redes, que complemento con una intensa curiosidad autodidacta por la Inteligencia Artificial y la Ciberseguridad.",
    "about_p2": "Actualmente, estoy profundizando en el desarrollo de modelos de IA desde cero (sin librerías) y administración avanzada de sistemas Linux. Me motiva resolver problemas complejos donde la optimización y el rendimiento son clave.",
    "skills_title": "Habilidades",
    "skill_cat_lang": "Lenguajes de Programación",
    "skill_cat_tech": "Tecnologías y Herramientas",
    "skill_db_mod": "Modelado de Bases de Datos y Tablas",
    "skill_cat_fund": "Fundamentos de Ingeniería",
    "projects_title": "Proyectos Destacados",
    "label_desc": "Descripción:",
    "label_achieve": "Logro:",
    "proj1_title": "Simulador de Red Neuronal en C++",
    "proj1_desc": "Desarrollo de una red neuronal feed-forward desde cero, sin usar librerías externas de IA. Implementé manualmente el algoritmo de backpropagation, funciones de activación y manejo de archivos binarios para entrenamiento.",
    "proj1_achieve": "Demostración de un profundo entendimiento de los fundamentos matemáticos de la IA y optimización de memoria en C++.",
    "proj2_title": "Sistema de Automatización de Reportes",
    "proj2_desc": "Solución empresarial para automatizar la generación de reportes de servicio. El sistema conecta Google Forms con Google Slides y Sheets, eliminando la entrada manual de datos.",
    "proj2_achieve": "Reducción estimada del 90% en el tiempo requerido para crear documentos repetitivos y eliminación del error humano.",
    "proj3_title": "UniTask - Plataforma Web",
    "proj3_desc": "Plataforma web tipo marketplace que conecta estudiantes para delegar y completar tareas académicas. Incluye sistema de autenticación de usuarios, gestión de base de datos y panel de administración.",
    "proj3_achieve": "Desarrollo full-stack completo, desde el diseño de base de datos hasta la interfaz de usuario.",
    "proj4_title": "Monitor de Procesos Linux",
    "proj4_desc": "Herramienta de auditoría para servidores Linux. Scripts personalizados para monitorear demonios críticos (Systemd), contar procesos activos y verificar la integridad del entorno.",
    "edu_title": "Educación",
    "edu_degree": "Ingeniería en Sistemas Computacionales",
    "edu_status": "Actualmente cursando (Promedio General: 8.0)",
    "edu_courses_title": "Cursos Destacados (Logrados):",
    "course_1": "Cinemática y Dinámica (10)",
    "course_2": "Programación Orientada a Objetos (9)",
    "course_3": "Sistemas de Información (9)",
    "course_4": "Memoria y Periféricos (9)",
    "edu_next": "Siguientes Pasos:",
    "edu_next_desc": "Procesamiento Digital de Imágenes y Seguridad WAN (Semestre 26-1).",
    "contact_next": "¿Qué sigue?",
    "contact_title": "Contáctame",
    "contact_desc": "Actualmente estoy buscando nuevas oportunidades para aplicar mis habilidades en automatización y análisis de datos. ¡Si tienes una pregunta o solo quieres saludar, escríbeme a hectore.salazar83@gmail.com!",
    "contact_btn": "Di Hola",
    "footer_credit": "Diseñado y Construido por Héctor Salazar"
}