{
    "nav_about": "À propos",
    "nav_skills": "Compétences",
    "nav_projects": "Projets",
    "nav_education": "Éducation",
    "nav_contact": "Contact",
    "hero_hi": "Bonjour, je m'appelle",
    "hero_subtitle": "Étudiant en Ingénierie des Systèmes et Développeur Logiciel",
    "hero_desc": "Spécialisé dans le travail au niveau système avec C++ et Linux, et passant au cloud avec des solutions d'Automatisation et Web. Je construis des logiciels efficaces en comprenant comment le matériel fonctionne en coulisses.",
    "hero_cta": "Voir les Projets",
    "about_title": "À propos de moi",
    "about_p1": "Je suis étudiant en Ingénierie des Systèmes Informatiques à l'UNITEC, ayant terminé plus de 65% de mon diplôme. Mon profil est hybride : je possède une solide base académique en Logique Numérique, Structures de Données et Réseaux, que je complète par une intense curiosité autodidacte pour l'Intelligence Artificielle et la Cybersécurité.",
    "about_p2": "Actuellement, je me plonge dans le développement de modèles d'IA à partir de zéro (sans bibliotecas) et l'administration système Linux avancée. Je suis motivé par la résolution de problèmes complexes où l'optimisation et la performance sont clés.",
    "skills_title": "Compétences",
    "skill_cat_lang": "Langages de Programmation",
    "skill_cat_tech": "Technologies et Outils",
    "skill_db_mod": "Modélisation de Bases de Données et Tables",
    "skill_cat_fund": "Fondamentaux de l'Ingénierie",
    "projects_title": "Projets en Vedette",
    "label_desc": "Description :",
    "label_achieve": "Réalisation :",
    "proj1_title": "Simulateur de Réseau Neuronal en C++",
    "proj1_desc": "Développement d'un réseau neuronal feed-forward à partir de zéro, sans utiliser de bibliothèques d'IA externes. J'ai implémenté manuellement l'algorithme de rétropropagation, les fonctions d'activation et la gestion des fichiers binaires pour l'entraînement.",
    "proj1_achieve": "Démonstration d'une compréhension approfondie des fondements mathématiques de l'IA et de l'optimisation de la mémoire en C++.",
    "proj2_title": "Système d'Automatisation de Rapports",
    "proj2_desc": "Solution d'entreprise pour automatiser la génération de rapports de service. Le système connecte Google Forms avec Google Slides et Sheets, éliminant la saisie manuelle de données.",
    "proj2_achieve": "Réduction estimée de 90% du temps nécessaire pour créer des documents répétitifs et élimination de l'erreur humaine.",
    "proj3_title": "UniTask - Plateforme Web",
    "proj3_desc": "Une plateforme web de type marketplace qui connecte les étudiants pour déléguer et compléter des tâches académiques. Elle comprend un système d'authentification des utilisateurs, une gestion de base de données et un panneau d'administration.",
    "proj3_achieve": "Développement full-stack complet, de la conception de la base de données à l'interface utilisateur.",
    "proj4_title": "Moniteur de Processus Linux",
    "proj4_desc": "Un outil d'audit pour les serveurs Linux. Scripts personnalisés pour surveiller les démons critiques (Systemd), compter les processus actifs et vérifier l'intégrité de l'environnement.",
    "edu_title": "Éducation",
    "edu_degree": "Ingénierie des Systèmes Informatiques",
    "edu_status": "Actuellement inscrit (Moyenne Générale : 8.0)",
    "edu_courses_title": "Cours Marquants (Réussis) :",
    "course_1": "Cinématique et Dynamique (10)",
    "course_2": "Programmation Orientée Objet (9)",
    "course_3": "Systèmes d'Information (9)",
    "course_4": "Mémoire et Périphériques (9)",
    "edu_next": "Prochaines Étapes :",
    "edu_next_desc": "Traitement Numérique d'Images et Sécurité WAN (Semestre 26-1).",
    "contact_next": "Et ensuite ?",
    "contact_title": "Contactez-moi",
    "contact_desc": "Je suis actuellement à la recherche de nouvelles opportunités pour appliquer mes compétences en automatisation et analyse de données. Que vous ayez une question ou que vous vouliez simplement dire bonjour, je ferai de mon mieux pour vous répondre !",
    "contact_btn": "Dire Bonjour",
    "footer_credit": "Conçu et Construit par Héctor Salazar"
}