{
    "nav_about": "Sobre",
    "nav_skills": "Habilidades",
    "nav_projects": "Projetos",
    "nav_education": "Educação",
    "nav_contact": "Contato",
    "hero_hi": "Olá, meu nome é",
    "hero_subtitle": "Estudante de Engenharia de Sistemas e Desenvolvedor de Software",
    "hero_desc": "Especializado em trabalhar no nível do sistema com C++ e Linux, e migrando para a nuvem com soluções de Automação e Web. Construo software eficiente entendendo como o hardware funciona nos bastidores.",
    "hero_cta": "Ver Projetos",
    "about_title": "Sobre Mim",
    "about_p1": "Sou estudante de Engenharia de Sistemas de Computação na UNITEC, com mais de 65% do curso concluído. Meu perfil é híbrido: possuo uma sólida base acadêmica em Lógica Digital, Estruturas de Dados e Redes, que complemento com uma intensa curiosidade autodidata por Inteligência Artificial e Cibersegurança.",
    "about_p2": "Atualmente, estou me aprofundando no desenvolvimento de modelos de IA do zero (sem bibliotecas) e administração avançada de sistemas Linux. Sou motivado por resolver problemas complexos onde otimização e desempenho são fundamentais.",
    "skills_title": "Habilidades",
    "skill_cat_lang": "Linguagens de Programação",
    "skill_cat_tech": "Tecnologias e Ferramentas",
    "skill_db_mod": "Modelagem de Banco de Dados e Tabelas",
    "skill_cat_fund": "Fundamentos de Engenharia",
    "projects_title": "Projetos em Destaque",
    "label_desc": "Descrição:",
    "label_achieve": "Conquista:",
    "proj1_title": "Simulador de Rede Neural em C++",
    "proj1_desc": "Desenvolvimento de uma rede neural feed-forward do zero, sem usar bibliotecas externas de IA. Implementei manualmente o algoritmo de backpropagation, funções de ativação e manipulação de arquivos binários para treinamento.",
    "proj1_achieve": "Demonstração de um profundo entendimento dos fundamentos matemáticos da IA e otimização de memória em C++.",
    "proj2_title": "Sistema de Automação de Relatórios",
    "proj2_desc": "Solução empresarial para automatizar a geração de relatórios de serviço. O sistema conecta Google Forms com Google Slides e Sheets, eliminando a entrada manual de dados.",
    "proj2_achieve": "Redução estimada de 90% no tempo necessário para criar documentos repetitivos e eliminação de erro humano.",
    "proj3_title": "UniTask - Plataforma Web",
    "proj3_desc": "Plataforma web tipo marketplace que conecta estudantes para delegar e completar tarefas acadêmicas. Inclui sistema de autenticação de usuários, gestão de banco de dados e painel de administração.",
    "proj3_achieve": "Desenvolvimento full-stack completo, desde o design do banco de dados até a interface do usuário.",
    "proj4_title": "Monitor de Processos Linux",
    "proj4_desc": "Ferramenta de auditoria para servidores Linux. Scripts personalizados para monitorar daemons críticos (Systemd), contar processos ativos e verificar a integridade do ambiente.",
    "edu_title": "Educação",
    "edu_degree": "Engenharia de Sistemas de Computação",
    "edu_status": "Atualmente cursando (Média Geral: 8.0)",
    "edu_courses_title": "Cursos de Destaque (Concluídos):",
    "course_1": "Cinemática e Dinâmica (10)",
    "course_2": "Programação Orientada a Objetos (9)",
    "course_3": "Sistemas de Informação (9)",
    "course_4": "Memória e Periféricos (9)",
    "edu_next": "Próximos Passos:",
    "edu_next_desc": "Processamento Digital de Imagens e Segurança WAN (Semestre 26-1).",
    "contact_next": "O que vem a seguir?",
    "contact_title": "Entre em Contato",
    "contact_desc": "Atualmente estou procurando novas oportunidades para aplicar minhas habilidades em automação e análise de dados. Se você tiver uma pergunta ou apenas quiser dizer olá, farei o possível para responder!",
    "contact_btn": "Diga Olá",
    "footer_credit": "Projetado e Construído por Héctor Salazar"
}